[
    {
        "id": 1,
        "company_logo": "https://example.com/logos/company1_logo.png",
        "job_title": "Software Developer",
        "company_name": "Tech Innovators",
        "remote_or_onsite": "Remote",
        "location": "Any Location",
        "fulltime_or_parttime": "Full-time",
        "salary": "$90,000 - $120,000",
        "job_description": "Join Tech Innovators as a Software Developer and play a crucial role in building innovative software solutions. We're seeking creative minds with a passion for problem-solving and coding. In this role, you will work remotely, collaborating with cross-functional teams to design, develop, and deploy software applications that make a difference.",
        "job_responsibility": "As a Software Developer, your responsibilities will include designing and implementing software solutions, writing high-quality code, debugging, and resolving software defects, and participating in code reviews. You will work on multiple projects, manage priorities effectively, and continuously improve your technical skills. Effective communication and collaboration with team members and stakeholders are essential.",
        "educational_requirements": "Bachelor's degree in Computer Science or related field.",
        "experience": "4+ years of software development experience.",
        "phone": "123-456-7890",
        "email": "jobs@techinnovators.com"
    },
    {
        "id": 2,
        "company_logo": "https://example.com/logos/company2_logo.png",
        "job_title": "Data Scientist",
        "company_name": "Data Experts Inc.",
        "remote_or_onsite": "Onsite",
        "location": "San Francisco, CA",
        "fulltime_or_parttime": "Full-time",
        "salary": "$100,000 - $130,000",
        "job_description": "At Data Experts Inc., we are looking for a talented Data Scientist to join our team. You will be based onsite in our San Francisco office and work on exciting data-driven projects. As a Data Scientist, you will have the opportunity to use your analytical skills to extract insights from complex datasets and drive data-driven decisions.",
        "job_responsibility": "As a Data Scientist, your responsibilities will include data analysis, statistical modeling, machine learning, and creating data visualizations. You will work with large datasets, develop predictive models, and communicate your findings effectively to both technical and non-technical stakeholders.",
        "educational_requirements": "Master's or Ph.D. in Data Science, Statistics, or related field.",
        "experience": "3+ years of data science experience.",
        "phone": "987-654-3210",
        "email": "jobs@dataexperts.com"
    },
    {
        "id": 3,
        "company_logo": "https://example.com/logos/company3_logo.png",
        "job_title": "UI/UX Designer",
        "company_name": "DesignSolutions",
        "remote_or_onsite": "Onsite",
        "location": "New York, NY",
        "fulltime_or_parttime": "Full-time",
        "salary": "$60,000 - $80,000",
        "job_description": "As a UI/UX Designer at DesignSolutions, you will be part of a dynamic team working onsite in New York City. Your role will involve creating user-friendly and visually appealing designs that enhance the user experience. We value creativity and innovation, and we're looking for a designer who can bring fresh ideas to our projects.",
        "job_responsibility": "You will be responsible for designing user interfaces, collaborating with developers and product managers, conducting user research, creating wireframes and prototypes, and ensuring the overall quality of the user experience. Effective communication with team members is essential to bring design concepts to life.",
        "educational_requirements": "Bachelor's degree in Graphic Design or related field.",
        "experience": "2+ years of UI/UX design experience.",
        "phone": "555-123-4567",
        "email": "jobs@designsolutions.com"
    },
    {
        "id": 4,
        "company_logo": "https://example.com/logos/company4_logo.png",
        "job_title": "Network Administrator",
        "company_name": "NetSys",
        "remote_or_onsite": "Onsite",
        "location": "Dallas, TX",
        "fulltime_or_parttime": "Full-time",
        "salary": "$70,000 - $90,000",
        "job_description": "Join NetSys as a Network Administrator and be part of a dedicated team managing and maintaining our network infrastructure. We're looking for professionals who can ensure the stability and security of our network operations.",
        "job_responsibility": "Your responsibilities will include configuring and monitoring network devices, troubleshooting network issues, implementing security measures, and collaborating with other IT professionals. You'll play a key role in maintaining our network's performance and reliability.",
        "educational_requirements": "Bachelor's degree in IT or related field.",
        "experience": "3-5 years of network administration experience.",
        "phone": "111-222-3333",
        "email": "jobs@netsys.com"
    },
    {
        "id": 5,
        "company_logo": "https://example.com/logos/company5_logo.png",
        "job_title": "Digital Marketing Specialist",
        "company_name": "MarketingTech",
        "remote_or_onsite": "Remote",
        "location": "Remote",
        "fulltime_or_parttime": "Full-time",
        "salary": "$65,000 - $85,000",
        "job_description": "As a Digital Marketing Specialist at MarketingTech, you'll have the opportunity to plan and execute digital marketing campaigns to promote our products. We're looking for creative individuals who can drive our online marketing efforts to success.",
        "job_responsibility": "Your responsibilities will include managing online marketing channels, optimizing ads, analyzing performance metrics, and developing strategies to improve our online presence. You'll work collaboratively with our marketing team and leverage your expertise in digital marketing to enhance our brand's visibility and engagement.",
        "educational_requirements": "Bachelor's degree in Marketing or related field.",
        "experience": "2-4 years of digital marketing experience.",
        "phone": "800-555-1234",
        "email": "jobs@marketingtech.com"
    },
    {
        "id": 6,
        "company_logo": "https://example.com/logos/company6_logo.png",
        "job_title": "Product Manager",
        "company_name": "InnovateTech",
        "remote_or_onsite": "Onsite",
        "location": "Seattle, WA",
        "fulltime_or_parttime": "Full-time",
        "salary": "$90,000 - $120,000",
        "job_description": "At InnovateTech, we're seeking an experienced Product Manager to lead the development of our innovative tech products. This role is based onsite in our Seattle office and offers a dynamic and collaborative work environment.",
        "job_responsibility": "As a Product Manager, you will define product strategy, work closely with development teams to bring products to market, and drive product success. You'll gather and prioritize requirements, set product goals, and ensure the product's alignment with the company's vision. Effective communication and strong leadership are key to this role.",
        "educational_requirements": "Bachelor's degree in Business or related field.",
        "experience": "5+ years of product management experience.",
        "phone": "123-789-4567",
        "email": "jobs@innovatetech.com"
    }
]